<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"4229cfa9098e755eae30b5b20e342ecb99704bb2ad341c26b7c300cc8335e50e","plan_job_ref":"Job Validations on PR #33 at https://github.com/SelfOverflow/discord-bots/actions/runs/22522295393","plan_out_hash":"b90fef69c185c28f75a5f2db77c139353a29a155a6133e838fa68db71a3ab0c7","plan_hash":"8852a8249dfb0af1f2320e793833fc1b49c06acbf31ae6c7cfc0a246be7edae7","plan_text_format":"diff","version":"2.0.0","closed":true} -->
Terraform plan in __./apps/bablu/terraform__
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.ecs is tainted, so must be replaced
-/+ resource "aws_cloudwatch_log_group" "ecs" {
!~      arn               = "arn:aws:logs:ap-south-1:613419461354:log-group:/ecs/bablu-bot" -> (known after apply)
!~      id                = "**************" -> (known after apply)
!~      log_group_class   = "STANDARD" -> (known after apply)
        name              = "/ecs/bablu-bot"
+       name_prefix       = (known after apply)
!~      retention_in_days = 0 -> 14
        tags              = {
            "Environment" = "mono"
            "ManagedBy"   = "terraform"
            "Project"     = "bablu-bot"
        }
#        (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

:x: Error applying plan in [Post merge deploy to production #21](https://github.com/SelfOverflow/discord-bots/actions/runs/22522327758)